Repository: hhyo/Archery
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: English
es: Ingles

source: Spanish
es: Castellano

source: Chinese Simplified
es: Chino Simplificado

source: Login To Archery
es: Iniciar Sesion en Archery

source: Login with DingTalk
es: Iniciar con DingTalk

source: CAS Login
es: Iniciar con CAS

source: Show traditional login
es: Mostrar login tradicional

source: Register
es: Registrarse

source: Create Account
es: Crear Cuenta

source: Username
es: Usuario

source: Display Name
es: Nombre a Mostrar

source: Email
es: Correo

source: Password
es: Contrasena

source: Confirm Password
es: Confirmar Contrasena

source: Cancel
es: Cancelar

source: Notice
es: Aviso

source: OK
es: Aceptar

source: Login
es: Ingresar

source: Registration successful! Please login.
es: Registro exitoso! Por favor inicia sesion.

source: SQL Review Platform
es: Plataforma de Revision SQL

source: Hello
es: Hola

source: System Info
es: Info del Sistema

source: Admin Panel
es: Panel de Admin

source: Two-Factor Auth
es: Autenticacion 2FA

source: Change Password
es: Cambiar Contrasena

source: Logout
es: Cerrar Sesion

source: SQL Review
es: Revision SQL

source: SQL Deployment
es: Despliegue SQL

source: SQL Analysis
es: Analisis SQL

source: SQL Query
es: Consulta SQL

source: Online Query
es: Consulta Online

source: Data Export
es: Exportar Datos

source: Data Dictionary
es: Diccionario de Datos

source: Permission Management
es: Gestion de Permisos

source: SQL Optimization
es: Optimizacion SQL

source: Optimization Tools
es: Herramientas de Optimizacion

source: Slow Query Log
es: Log de Queries Lentas

source: Instance Management
es: Gestion de Instancias

source: Instance List
es: Lista de Instancias

source: Session Management
es: Gestion de Sesiones

source: Database Management
es: Gestion de Bases de Datos

source: Account Management
es: Gestion de Cuentas

source: Parameter Configuration
es: Configuracion de Parametros

source: Tools & Plugins
es: Herramientas y Plugins

source: System Management
es: Gestion del Sistema

source: Configuration
es: Configuracion

source: Resource Groups
es: Grupos de Recursos

source: Other Settings
es: Otras Configuraciones

source: User Management
es: Gestion de Usuarios

source: Permission Groups
es: Grupos de Permisos

source: All Backend Data
es: Todos los Datos del Backend

source: System Audit
es: Auditoria del Sistema

source: General Audit
es: Auditoria General

source: SQL Deployment Audit
es: Auditoria de Despliegue SQL

source: Query Audit
es: Auditoria de Consultas

source: Documentation
es: Documentacion

source: Two-Factor Verification
es: Verificacion de Dos Factores

source: Close
es: Cerrar

source: Verify Current Password
es: Verificar Contrasena Actual

source: Enter password to verify
es: Ingresa la contrasena para verificar

source: Confirm
es: Confirmar

source: Scan to Bind
es: Escanear para Vincular

source: Bind Phone Number
es: Vincular Numero de Telefono

source: Use Google Authenticator to scan
es: Usa Google Authenticator para escanear

source: Enter phone number to bind
es: Ingresa el numero de telefono a vincular

source: Enter 6-digit verification code
es: Ingresa el codigo de verificacion de 6 digitos

source: Get Verification Code
es: Obtener Codigo de Verificacion

source: Bind
es: Vincular

source: Enabled
es: Activado

source: Disabled
es: Desactivado

source: All Data
es: Todos los Datos

source: Workflow Log
es: Registro de Workflow

source: Workflow Name
es: Nombre de Workflow

source: Full Workflow Name
es: Nombre Completo de Workflow

source: Initiator
es: Iniciador

source: Workflow Status
es: Estado del Workflow

source: Initiated Time
es: Tiempo de Inicio

source: Target Instance
es: Instancia de Destino

source: Operations
es: Operaciones

source: Operation Log
es: Registro de Operación

source: Operator
es: Operador

source: Operation Time
es: Tiempo de Operación

source: Operation Info
es: Información de Operación

source: Submit Export Workflow
es: Enviar Workflow de Exportación

source: All Instances
es: Todas las Instancias

source: Enable Status
es: Estado de Activación

source: Apply for Archive
es: Solicitar Archivado

source: Add Configuration
es: Agregar Configuración

source: Apply for Data Archive
es: Solicitar Archivado de Datos

source: Brief description of the archive
es: Descripción breve del archivado

source: Please select group:
es: Por favor seleccione grupo:

source: Please select source instance:
es: Por favor seleccione instancia origen:

source: Please select instance:
es: Por favor seleccione instancia:

source: Please select source database:
es: Por favor seleccione base de datos origen:

source: Please select database:
es: Por favor seleccione base de datos:

source: Please select table to archive:
es: Por favor seleccione tabla a archivar:

source: Please select archive mode:
es: Por favor seleccione modo de archivado:

source: Archive to file
es: Archivar a archivo

source: Archive to another instance
es: Archivar a otra instancia

source: Delete directly
es: Eliminar directamente

source: Keep source data after archiving:
es: Mantener datos origen después del archivado:

source: Keep source data after archiving
es: Mantener datos origen después del archivado

source: Keep
es: Mantener

source: Please select destination instance:
es: Por favor seleccione instancia destino:

source: Please select destination database:
es: Por favor seleccione base de datos destino:

source: Please select corresponding database:
es: Por favor seleccione base de datos correspondiente:

source: Please select destination table:
es: Por favor seleccione tabla destino:

source: Enter archive condition (WHERE clause of SQL statement)
es: Ingrese condición de archivado (cláusula WHERE de la sentencia SQL)

source: Sleep seconds after archiving 10000 rows
es: Segundos de pausa después de archivar 10000 filas

source: Approval Process:
es: Proceso de Aprobación:

source: Note: Source and destination table structures must be consistent, otherwise archiving will fail
es: Nota: Las estructuras de las tablas origen y destino deben ser consistentes, de lo contrario el archivado fallará

source: Submit Application
es: Enviar Solicitud

source: Feishu App ID
es: ID de Aplicación Feishu

source: Feishu AppSecret
es: AppSecret de Feishu

source: Generic Webhook URL
es: URL de Webhook Genérico

source: Generic webhook URL, called on every status change of each workflow
es: URL de webhook genérico, llamado en cada cambio de estado de cada workflow

source: SMS Service
es: Servicio SMS

source: SMS Service Provider
es: Proveedor de Servicio SMS

source: SMS Provider
es: Proveedor SMS

source: Aliyun Access Key ID, used to identify User
es: ID de Clave de Acceso Aliyun, usado para identificar Usuario

source: Aliyun Access Key Secret, used to verify User identity
es: Secreto de Clave de Acceso Aliyun, usado para verificar identidad de Usuario

source: SMS signature, must be approved status
es: Firma SMS, debe estar en estado aprobado

source: SMS template code, must be approved status
es: Código de plantilla SMS, debe estar en estado aprobado

source: Variable name in SMS template, e.g.: code
es: Nombre de variable en plantilla SMS, ej.: code

source: Used to identify API caller identity
es: Usado para identificar identidad del llamador de API

source: Key used for encrypting signature and server-side verification
es: Clave usada para cifrar firma y verificación del lado del servidor

source: SMS template ID, must be approved status
es: ID de plantilla SMS, debe estar en estado aprobado

source: SMS Application ID
es: ID de Aplicación SMS

source: Login button display name, e.g. Login With KeyCloak
es: Nombre a mostrar en botón de login, ej. Iniciar Sesión con KeyCloak

source: Note 1: If OPENAI_API_KEY is not configured, related features will not be enabled
es: Nota 1: Si OPENAI_API_KEY no está configurado, las funciones relacionadas no se habilitarán

source: Note 2: DEFAULT_CHAT_MODEL defaults to gpt-3.5-turbo, DEFAULT_QUERY_TEMPLATE defaults to system-defined template
es: Nota 2: DEFAULT_CHAT_MODEL por defecto es gpt-3.5-turbo, DEFAULT_QUERY_TEMPLATE por defecto es plantilla definida por el sistema

source: Default Django template for generating SQL statements, empty template will cause generation to fail, requires db_type/table_schema/user_input
es: Plantilla Django por defecto para generar sentencias SQL, plantilla vacía causará fallo en generación, requiere db_type/table_schema/user_input

source: Other Configuration
es: Otra Configuración

source: System homepage path, default is SQL workflow page: sqlworkflow
es: Ruta de página principal del sistema, por defecto es página de workflow SQL: sqlworkflow

source: my2sql call path, e.g. /opt/archery/src/plugins/my2sql
es: Ruta de llamada my2sql, ej. /opt/archery/src/plugins/my2sql

source: Permission groups automatically assigned to new users on first login
es: Grupos de permisos asignados automáticamente a nuevos usuarios en primer login

source: Resource groups automatically assigned to new users on first login
es: Grupos de recursos asignados automáticamente a nuevos usuarios en primer login

source: API User Whitelist
es: Lista Blanca de Usuarios API

source: Account lockout time after failed login (seconds)
es: Tiempo de bloqueo de cuenta después de login fallido (segundos)

source: Number of failed login attempts before account lockout
es: Número de intentos fallidos de login antes de bloqueo de cuenta

source: Enable user registration
es: Habilitar registro de usuarios

source: Enable watermark
es: Habilitar marca de agua

source: Enforce 2FA on login
es: Forzar 2FA en login

source: Enable announcements
es: Habilitar anuncios

source: Announcement content
es: Contenido de anuncio

source: Append this content to website title and login page, useful for distinguishing multiple Archery instances
es: Agregar este contenido al título del sitio web y página de login, útil para distinguir múltiples instancias de Archery

source: Rules:
es: Reglas:

source: Selecting multiple permission groups creates multi-level approval, flowing in selection order, all users in a group can approve
es: Seleccionar múltiples grupos de permisos crea aprobación multi-nivel, fluyendo en orden de selección, todos los usuarios en un grupo pueden aprobar

source: Current Approval Process:
es: Proceso de Aprobación Actual:

source: Apply for Database Query Permission
es: Solicitar Permiso de Consulta de Base de Datos

source: Brief description of permission usage
es: Descripción breve del uso del permiso

source: Permission level:
es: Nivel de permiso:

source: Please select table:
es: Por favor seleccione tabla:

source: Please select authorization period:
es: Por favor seleccione período de autorización:

source: One day
es: Un día

source: One week
es: Una semana

source: One month
es: Un mes

source: Long term (one year)
es: Largo plazo (un año)

source: Please select query row limit:
es: Por favor seleccione límite de filas de consulta:

source: Note: After permission approval, you can perform online queries. Please wait patiently.
es: Nota: Después de la aprobación del permiso, puede realizar consultas en línea. Por favor espere pacientemente.

source: {0} items selected
es: {0} elementos seleccionados

source: Table list:
es: Lista de tablas:

source: Database list:
es: Lista de bases de datos:

source: Permission Level
es: Nivel de Permiso

source: Result Set
es: Conjunto de Resultados

source: Valid Until
es: Válido Hasta

source: Applicant
es: Solicitante

source: Application Time
es: Tiempo de Solicitud

source: Information incomplete or approval process not configured
es: Información incompleta o proceso de aprobación no configurado

source: Please select permission type
es: Por favor seleccione tipo de permiso

source: Parse Threads:
es: Hilos de Análisis:

source: Default 4
es: Por defecto 4

source: Parse Range Control:
es: Control de Rango de Análisis:

source: Parse row count per page, default 30
es: Cantidad de filas a analizar por página, por defecto 30

source: Start parse file:
es: Archivo de inicio de análisis:

source: Start parse position (optional)
es: Posición de inicio de análisis (opcional)

source: End parse file (optional):
es: Archivo de fin de análisis (opcional):

source: End parse position (optional)
es: Posición de fin de análisis (opcional)

source: Start parse time (not recommended)
es: Tiempo de inicio de análisis (no recomendado)

source: End parse time (optional)
es: Tiempo de fin de análisis (opcional)

source: Object Filter:
es: Filtro de Objetos:

source: Database filter (optional):
es: Filtro de base de datos (opcional):

source: Table filter (optional):
es: Filtro de tabla (opcional):

source: Type filter (optional):
es: Filtro de tipo (opcional):

source: SQL Statements
es: Sentencias SQL

source: Frontend display count is controlled by parse range parameter. If 'Save to file' is checked, complete SQL file will be asynchronously saved to downloads directory. Notification will be sent to operator after execution ends (if message notification is enabled).
es: La cantidad mostrada en el frontend es controlada por el parámetro de rango de análisis. Si 'Guardar a archivo' está marcado, el archivo SQL completo se guardará de forma asíncrona en el directorio de descargas. Se enviará una notificación al operador cuando termine la ejecución (si la notificación de mensajes está habilitada).

source: Full SQL
es: SQL Completo

source: Please select instance and start parse file!
es: ¡Por favor seleccione instancia y archivo de inicio de análisis!

source: Extra Info
es: Información Extra

source: Full Extra Info
es: Información Extra Completa

source: Query Time
es: Tiempo de Consulta

source: Statement
es: Sentencia

source: Full Statement
es: Sentencia Completa

source: Rows Returned
es: Filas Devueltas

source: Duration (seconds)
es: Duración (segundos)

source: Change Approval Process:
es: Cambiar Proceso de Aprobación:

source: Please select approver permission group
es: Por favor seleccione grupo de permisos de aprobador

source: Approver
es: Aprobador

source: Approver:
es: Aprobador:

source: Change
es: Cambiar

source: Archive Mode
es: Modo de Archivado

source: Source Data
es: Datos Origen

source: Sleep (seconds)
es: Pausa (segundos)

source: Delete
es: Eliminar
